package main

var countryMap map[string]string
var CityMap map[string]string

func Initlist() {
	CityMap = make(map[string]string)
	CityMap["北京市 移动"] = "39.156.128.0"
	CityMap["北京市 联通"] = "114.240.0.0"
	CityMap["北京市 电信"] = "1.202.0.0"
	CityMap["北京市 教育网"] = "58.200.0.0"

	CityMap["黑龙江 哈尔滨 移动"] = "211.137.243.0"
	CityMap["黑龙江 哈尔滨 联通"] = "113.0.0.0"
	CityMap["黑龙江 哈尔滨 电信"] = "42.100.0.0"
	CityMap["黑龙江 哈尔滨 教育网"] = "58.194.0.0"

	CityMap["吉林 长春 移动"] = "39.134.160.0"
	CityMap["吉林 长春 联通"] = "119.48.0.0"
	CityMap["吉林 长春 电信"] = "36.48.0.0"
	CityMap["吉林 长春 教育网"] = "59.72.0.0"

	CityMap["辽宁 沈阳 移动"] = "211.137.32.0"
	CityMap["辽宁 沈阳 联通"] = "113.224.0.0"
	CityMap["辽宁 沈阳 电信"] = "182.200.0.0"
	CityMap["辽宁 沈阳 教育网"] = "219.216.0.0"

	CityMap["上海 移动"] = "211.137.243.0"
	CityMap["上海 联通"] = "220.248.0.0"
	CityMap["上海 电信"] = "101.80.0.0"
	CityMap["上海 教育网"] = "58.194.0.0"

	CityMap["天津 天津 移动"] = "211.137.160.1"
	CityMap["天津 天津 联通"] = "61.181.81.1"
	CityMap["天津 天津 电信"] = "221.238.6.1"
	CityMap["天津 天津 教育网"] = "58.207.63.253"

	CityMap["重庆 重庆 移动"] = "218.201.39.204"
	CityMap["重庆 重庆 联通"] = "221.5.255.1"
	CityMap["重庆 重庆 电信"] = "218.70.65.254"
	CityMap["重庆 重庆 教育网"] = "202.202.216.1"

	CityMap["河北 石家庄 移动"] = "218.207.75.1"
	CityMap["河北 石家庄 联通"] = "221.192.1.1"
	CityMap["河北 石家庄 电信"] = "123.180.0.200"
	CityMap["河北 石家庄 教育网"] = "202.206.232.1"

	CityMap["山西 太原 移动"] = "211.142.24.17"
	CityMap["山西 太原 联通"] = "221.204.253.1"
	CityMap["山西 太原 电信"] = "219.149.144.1"
	CityMap["山西 太原 教育网"] = "202.207.130.1"

	CityMap["广东 广州 移动"] = "211.139.145.34"
	CityMap["广东 广州 联通"] = "211.95.193.69"
	CityMap["广东 广州 电信"] = "58.61.200.1"
	CityMap["广东 广州 教育网"] = "202.116.64.8"

	CityMap["江苏 南京 移动"] = "120.195.118.1"
	CityMap["江苏 南京 联通"] = "218.104.118.33"
	CityMap["江苏 南京 电信"] = "58.212.24.1"
	CityMap["江苏 南京 教育网"] = "202.119.32.7"
}
